<?php  return array (
  'resourceClass' => 'modDocument',
  'resource' => 
  array (
    'id' => 25,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Согласие на сбор и обработку персональных данных',
    'longtitle' => '',
    'description' => '',
    'alias' => 'collect',
    'alias_visible' => 1,
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 22,
    'isfolder' => 0,
    'introtext' => '',
    'content' => '<div class="row">
<div class="col l11 m12">
<h1>Согласие на обработку персональных данных</h1>
<p>Я, cвоей волей и в своем интересе даю согласие на обработку, в том числе на сбор, систематизацию, накопление, хранение (уточнение, обновление, изменение), использование, обезличивание, блокирование и уничтожение моих персональных данных &ndash; фамилии, имени, отчества, адреса доставки, номера контактного телефона, адреса электронной почты, Стремецкому Михаилу Викторовичу (именуемому в дальнейшем &laquo;Продавец&raquo;), расположенному по адресу: 350040, Россия, Краснодарский край, г. Краснодар, ул. Бургасская, 4 с целью продажи (предоставления) мне товаров и услуг (продуктов), осуществления доставки, предоставления сервисных услуг, получения обратной связи.</p>
<p>Подтверждаю, что персональные данные и иные сведения, относящиеся ко мне (фамилия, имя, отчество, адрес доставки, номер контактного телефона, адрес электронной почты) предоставлены Продавцу мною добровольно и являются достоверными путем внесения их при регистрации на сайте бурый-медведь.рф или по телефону в устной беседе . Я извещен о том, что в случае недостоверности предоставленных персональных и сведений Продавец оставляет за собой право прекратить обслуживание посредством сайта бурый-медведь.рф.</p>
<p>Я согласен, что мои персональные данные будут обрабатываться способами, соответствующими целям обработки персональных данных, без возможности принятия решения на основании исключительно автоматизированной обработки моих персональных данных.</p>
<p>Согласие дается мной с момента регистрации или оформления заказа на сайте бурый-медведь.рф</p>
<p>Настоящее согласие может быть отозвано мной в любой момент путем направления письменного требования в адрес Продавца. Адрес электронной почты Продавца: brownbear23@mail.ru</p>
</div>
<div class="col l11 m12 offset-l1">
<h2>Политика в отношении обработки персональных данных</h2>
<h3>1. ОСНОВНЫЕ ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ:</h3>
<p>В настоящей политике используются следующие основные понятия:</p>
<ul class="browser-default">
<li>персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных);</li>
<li>оператор &ndash; Интернет-ресурс BrownBear, именуемый далее Сайт, самостоятельно организующий и осуществляющий обработку персональных данных, а также определяющий цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</li>
<li>обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</li>
<li>автоматизированная обработка персональных данных - обработка персональных данных с помощью средств вычислительной техники;</li>
<li>распространение персональных данных - действия, направленные на раскрытие персональных данных неопределенному кругу лиц;</li>
<li>предоставление персональных данных - действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;</li>
<li>блокирование персональных данных - временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);</li>
<li>уничтожение персональных данных - действия, в результате которых становится невозможным восстановить содержание персональных данных в информационной системе персональных данных и (или) в результате которых уничтожаются материальные носители персональных данных;</li>
<li>обезличивание персональных данных - действия, в результате которых становится невозможным без использования дополнительной информации определить принадлежность персональных данных конкретному субъекту персональных данных;</li>
<li>информационная система персональных данных - совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств;</li>
<li>трансграничная передача персональных данных - передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому лицу или иностранному юридическому лицу.</li>
</ul>
</div>
<div class="col l11 m12">
<h3>2. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
<p>Сайт, основываясь на целях безусловного выполнения требований законодательства РФ и поддержания своей деловой репутации, считает своими задачами исполнение принципов справедливости, законности, конфиденциальности, безопасности при обработке персональных данных.</p>
<p>Настоящая политика в отношении обработки персональных данных: - разработана с учетом требований Конституции РФ, законодательства Российской Федерации, нормативных правовых актов Российской Федерации в области персональных данных;</p>
<ul class="browser-default">
<li>определяет основные принципы, цели и способы обработки персональных данных, состав субъектов персональных данных и их права, действия Сайта при обработке персональных данных, меры, принимаемые по защите персональных данных, а также меры по контролю за соблюдением требований законодательства и данной политики;</li>
<li>является общедоступным документом, которым регулируется деятельность Сайта при обработке персональных данных.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>3. ИНФОРМАЦИЯ ОБ ОПЕРАТОРЕ</h3>
<table class="material-table">
<tbody>
<tr>
<td>ИНН</td>
<td><strong>800302612330</strong></td>
</tr>
<tr>
<td>Юрид. адрес</td>
<td><strong>350040, Россия, Краснодарский край, г. Краснодар, ул. Бургасская, 4</strong></td>
</tr>
<tr>
<td>Телефон</td>
<td><strong>+7 (918) 077-5831</strong></td>
</tr>
<tr>
<td>Дополнительный телефон</td>
<td><strong>+7 (918) 634-3486</strong></td>
</tr>
<tr>
<td>E-mail</td>
<td><strong>brownbear23@mail.ru</strong></td>
</tr>
</tbody>
</table>
</div>
<div class="col l11 m12">
<h3>4. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Данная политика в отношении обработки персональных данных составлена в соответствии с требованиями следующих нормативно-правовых актов РФ:</p>
<ul class="browser-default">
<li>Конституции Российской Федерации;</li>
<li>Федерального закона от 27 июля 2006 года №152-ФЗ &laquo;О персональных данных&raquo;;</li>
<li>Указа Президента Российской Федерации от 06 марта 1997 г. № 188 &laquo;Об утверждении Перечня сведений конфиденциального характера&raquo;;</li>
<li>постановления Правительства Российской Федерации от 13 сентября 2008 года №687 &laquo;Об утверждении Положения об особенностях обработки персональных данных, осуществляемой без использования средств автоматизации&raquo;;</li>
<li>постановления Правительства Российской Федерации от 01 ноября 2012 года №1119 &laquo;Об утверждении требований к защите персональных данных при их обработке в информационных системах персональных данных&raquo;;</li>
<li>приказа ФСТЭК России от 18 февраля 2013 г. №21 &laquo;Об утверждении состава и содержания организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных&raquo;;</li>
<li>приказа Роскомнадзора от 05 сентября 2013 №996 &laquo;Об утверждении требований и методов по обезличиванию персональных данных&raquo;;</li>
<li>иных нормативно-правовых актов Российской Федерации и нормативных документов уполномоченных органов государственной власти.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>5. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Сайт обрабатывает персональные данные исключительно в целях:</p>
<ul class="browser-default">
<li>осуществления хозяйственной деятельности, направленной на извлечение прибыли путем розничной продажи товаров (в частности питьевой воды, оборудования для розлива воды, фильтров для воды, одноразовой посуды и др.).</li>
<li>оказание экспедиционных и транспортных услуг, необходимых для реализации продукции; организации гарантийного сервисного обслуживания;</li>
<li>оказания снабженческих, сбытовых, юридических, финансовых, информационно-консультационных и маркетинговых услуг;</li>
<li>исполнения договора, одной из сторон (либо выгодоприобретателем) которого является субъект персональных данных (включая трудовые отношения с работниками Оператора, отношения с контрагентами/поставщиками и с покупателями/клиентами Оператора).</li>
</ul>
</div>
<div class="col l11 m12">
<h3>6. СУБЪЕКТЫ И КАТЕГОРИИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>В информационных системах персональных данных Сайта обрабатываются персональные данные следующих субъектов персональных данных:</p>
<ul class="browser-default">
<li>штатных и нештатных работников, состоящих в трудовых/договорных отношениях с Интернет- магазином и/или их близкие родственники;</li>
<li>физических лиц - покупателей/клиентов Сайта;</li>
<li>физических лиц - контрагентов по договорам, заключенным Сайтом.</li>
<li>граждан, обратившиеся с жалобами, заявлениями, их законные представители;</li>
<li>граждан, направившие резюме при устройстве на работу, а так же соискатели заполнившие анкету для участия в конкурсе на замещение вакантных должностей.</li>
<li>Сайт осуществляет обработку следующих категорий персональных данных общей категории: фамилия, имя, отчество, адрес доставки, контактные данные (номера телефонов, адреса электронной почты), учредительные документы, реквизиты доверенности или иного документа, подтверждающие полномочия, дата рождения, месяц рождения, год рождения, место рождения, данные документов, удостоверяющих личность, адрес (регистрации по месту жительства и фактического проживания).</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>7. ОСНОВНЫЕ ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Обработка персональных данных на Сайте ведется с учетом обеспечения защиты прав и свобод как работников Сайта так и иных лиц при обработке их персональных данных, в том числе прав на неприкосновенность частной жизни, личную и семейную тайну на основе принципов:</p>
<ul class="browser-default">
<li>законности и справедливости обработки персональных данных;</li>
<li>ограничения обработки персональных данных достижением конкретных, заранее определенных и законных целей;</li>
<li>соответствия целей и способов обработки персональных данных тем целям, которые были заявлены при сборе данных;</li>
<li>недопустимости объединения баз данных, созданных с разными целями для обработки персональных данных;</li>
<li>соответствия необходимости и достаточности объема, характера и способов обработки персональных данных заявленным целям их обработки;</li>
<li>обеспечения точности, достоверности и, при необходимости, актуальности по отношению к целям обработки;</li>
<li>хранения персональных данных в форме, позволяющей определить субъекта персональных данных не дольше, чем того требуют цели обработки, требования законодательства или договора, по которому выгодоприобретателем является субъект персональных данных;</li>
<li>уничтожения или обезличивания персональных данных по достижении целей или утраты необходимости в достижении этих целей, если иное не предусмотрено требованиями законодательства.</li>
</ul>
</div>
<div class="col l11 m12">
<h3>8. ДЕЙСТВИЯ С ПЕРСОНАЛЬНЫМИ ДАННЫМИ</h3>
<p>Сайт осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
<p>В Сайте обработка персональных данных осуществляется следующими способами:</p>
<ul class="browser-default">
<li>автоматизированная обработка персональных данных;</li>
<li>неавтоматизированная обработка персональных данных;</li>
<li>смешанная обработка персональных данных.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>9. МЕРЫ ПО ВЫПОЛНЕНИЮ ОБЯЗАННОСТЕЙ САЙТА В ОБЕСПЕЧЕНИИ БЕЗОПАСНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПРИ ИХ ОБРАБОТКЕ</h3>
<p>Носители информации, содержащие персональные данные, хранятся в специальных строго контролируемых помещениях, расположенных в пределах границ контролируемых и охраняемых зон. Помещения, где хранятся персональные данные, и технические средства, с помощью которых производится обработка персональных данных, находятся под круглосуточной охраной и видеонаблюдением.</p>
<p>Информационный доступ к техническим средствам, с помощью которых производится обработка персональных данных, реализован через автоматизированные рабочие места, защищенные от несанкционированного доступа. В зависимости от степени критичности информации разграничение (ограничение) доступа проводится программно-аппаратными средствами идентификации и аутентификации пользователей.</p>
<p>Разграничен (ограничен) доступ персонала и посторонних лиц в защищаемые помещения и помещения, где размещены средства информатизации и коммуникации, а также где хранятся носители с персональными данными.</p>
<p>Информация доступна лишь для строго определенных работников. Производится запись (логирование) входа/выхода работников в/из операционную(ой) систему(ы), работы в автоматизированных рабочих местах, доступа к базам данных.</p>
<p>Реализована защита информации от сбоев оборудования и вредоносного программного обеспечения. Применяется система восстановления информации.</p>
<p>При работе в сетях безопасность информации обеспечивается средствами межсетевого экранирования, созданием демилитаризованных зон, виртуальных частных сетей, защищенных каналов связи, применением защищенных протоколов передачи информации и программно-аппаратных средств шифрования информации.</p>
</div>
<div class="col l11 m12">
<h3>10. ОТВЕТСТВЕННОСТЬ И КОНТРОЛЬ ЗА СОБЛЮДЕНИЕМ ТРЕБОВАНИЙ НАСТОЯЩЕЙ ПОЛИТИКИ И ЗАКОНОДАТЕЛЬСТВА В ОБЛАСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Ответственным за соблюдением требований законодательства в области персональных данных и настоящей политики является старший менеджер Сайта.</p>
<p>Лицо, ответственное за организацию и обеспечение безопасности персональных данных, в рамках выполнения положений настоящей политики и законных актов Российской Федерации в области персональных данных уполномочено:</p>
<ul class="browser-default">
<li>определять угрозы безопасности персональных данных при их обработке в информационных системах персональных данных;</li>
<li>планировать применение организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных, необходимых для противодействия угрозам безопасности персональных данных и выполнения требований к защите персональных данных;</li>
<li>организовывать контроль и/или аудит соответствия принятых мер защиты при обработке персональных данных Федеральному закону от 27.07.2006 №152-ФЗ &laquo;О персональных данных&raquo;, нормативным правовым актам, требованиям нормативных актов к защите персональных данных, локальным актам;</li>
<li>оценивать эффективность принимаемых мер по обеспечению безопасности персональных данных до ввода в эксплуатацию информационной системы персональных данных и организовывать мониторинг уровня защищенности персональных данных при эксплуатации информационной системы персональных данных;</li>
<li>проводить анализ по фактам нарушения положений настоящей политики; разрабатывать и принимать соответствующие меры на поддержание необходимого уровня защищенности персональных данных;</li>
<li>организовывать прием и обработку обращений и запросов регулирующих органов РФ, субъектов персональных данных или их представителей.</li>
</ul>
<p>Лица, виновные в нарушении норм действующего законодательства Российской Федерации в области персональных данных могут быть привлечены к дисциплинарной, административной, гражданской и уголовной ответственности в порядке, установленном действующим законодательством Российской Федерации.</p>
</div>
<div class="col l11 m12 offset-l1">
<h3>11. ПРАВА СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Субъект персональных данных имеет право на получение информации об обработке его персональных данных на Сайте, в том числе содержащую:</p>
<ul class="browser-default">
<li>подтверждение факта обработки персональных данных;</li>
<li>правовое основание, цели и сроки обработки персональных данных;</li>
<li>способы обработки персональных данных;</li>
<li>иные сведения, предусмотренные законодательством Российской Федерации.</li>
</ul>
<p>Право субъекта персональных данных на доступ к его персональным данным может быть ограничено:</p>
<ul class="browser-default">
<li>если обработка персональных данных, включая те, что получены в результате оперативно-розыскной деятельности, выполняется в целях укрепления обороны страны, обеспечения безопасности государства и охраны правопорядка;</li>
<li>легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма если обработка персональных данных осуществляется в соответствии с законодательством о противодействии;</li>
<li>если доступ субъекта персональных данных нарушает права и законные интересы третьих лиц; при условии, что обработка персональных данных производится органами, осуществляющими задержание субъекта персональных данных по подозрению в совершении преступления, либо предъявившими субъекту персональных данных обвинение по уголовному делу, либо применившими к субъекту персональных данных меру пресечения до предъявления обвинения, за исключением предусмотренных уголовно-процессуальным законодательством Российской Федерации случаев, когда допускается ознакомление подозреваемого или обвиняемого с такими персональными данными;</li>
<li>если обработка персональных данных осуществляется в случаях, предусмотренных законодательством Российской Федерации о транспортной безопасности, в целях обеспечения устойчивого и безопасного функционирования транспортного комплекса, защиты интересов личности, общества и государства в сфере транспортного комплекса от актов незаконного вмешательства.</li>
</ul>
<p>Субъект персональных данных имеет право на:</p>
<ul class="browser-default">
<li>уточнение своих персональных данных, их блокирование или уничтожение, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки:</li>
<li>отзыв согласия на обработку персональных данных;</li>
<li>осуществление иных прав, предусмотренных законодательством Российской Федерации в области персональных данных.</li>
</ul>
<p>Для реализации своих прав и законных интересов субъект персональных данных может обратиться на Сайт.</p>
<p>Сайт рассматривает обращения и жалобы со стороны субъектов персональных данных, тщательно расследует факты нарушений и принимает все необходимые меры для их немедленного устранения, наказания виновных лиц и урегулирования спорных и конфликтных ситуации в досудебном порядке.</p>
<p>Субъект персональных данных вправе обжаловать действия или бездействие Сайта путем обращения в уполномоченных орган по защите прав субъектов персональных данных. Субъект персональных данных имеет право на защиту своих прав и законных интересов, в том числе в судебном порядке.</p>
</div>
<div class="col l11 m12">
<h3>12. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
<p>Настоящая политика разработана и утверждена Стремецким Михаилом Викторовичем</p>
<p>Настоящая Политика является внутренним документом Оператора, общедоступной и подлежит размещению на официальном сайте Оператора.</p>
<p>Настоящая Политика подлежит изменению, дополнению в случае появления новых законодательных актов и специальных нормативных документов по обработке и защите персональных данных Контроль исполнения требований настоящей Политики осуществляется ответственными за обеспечение безопасности персональных данных.</p>
<p>Ответственность должностных лиц Оператора, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных, определяется в соответствии с законодательством Российской Федерации и внутренними документами Оператора.</p>
</div>
</div>',
    'richtext' => 1,
    'template' => 4,
    'menuindex' => 2,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 1,
    'createdon' => 1681812649,
    'editedby' => 1,
    'editedon' => 1681995929,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 1681812600,
    'publishedby' => 1,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 0,
    'class_key' => 'modDocument',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => 'collect.html',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => NULL,
    '_content' => '<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>BrownBear – монтаж на высоте || Согласие на сбор и обработку персональных данных</title>
<link rel="stylesheet" href="/css/master.css">
<link rel="stylesheet" href="/css/pages/.css">

<link rel="apple-touch-icon" sizes="180x180" href="/img/favico/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/img/favico/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/img/favico/favicon-16x16.png">
<link rel="manifest" href="/img/favico/site.webmanifest">
<link rel="mask-icon" href="/img/favico/safari-pinned-tab.svg" color="#5bbad5">
<link rel="shortcut icon" href="/img/favico/favicon.ico">
<meta name="msapplication-TileColor" content="#3c3c3c">
<meta name="msapplication-config" content="/img/favico/browserconfig.xml">
<meta name="theme-color" content="#ffffff">
</head>
<body>
    <header>
	<nav class="top">
		<div class="container">
			<ul>
				<li><a href="#mobile" class="mdi mdi-menu burger sidenav-trigger"></a></li>
				<li><a href="/" class="logo"></a></li>
			</ul>
			[[!Wayfinder?
			    &startId=`0`
			    &excludeDocs=`1`
			    &outerTpl=`@CODE <ul class="menu">[[+wf.wrapper]]</ul>`
			    &innerTpl=`@CODE <div class="submenu"><ul class="container">[[+wf.wrapper]]</ul></div>`
			]]
			<div class="separator"></div>
			<ul>
				<li class="phone">
					<a href="tel://+79180775831" class="phone">
						<i class="mdi mdi-phone"></i>
						<span>+7 (918) 077-5831</span>
					</a>
				</li>
				<li class="nav-icon"><a href="https://t.me/+79180775831" class="mdi mdi-telegram"></a></li>
				<li class="nav-icon"><a href="https://wa.me/+79180775831" class="mdi mdi-whatsapp"></a></li>
			</ul>
		</div>
	</nav>
</header>
[[!Wayfinder? 
    &startId=`0` 
    &outerTpl=`@CODE <ul class="sidenav" id="mobile">[[+wf.wrapper]]</ul>`
    &innerTpl=`@CODE <ul>[[+wf.wrapper]]</ul>`
]]
    <main id="docs">
        <section id="main-docs">
            <div class="container">
                <div class="row">
<div class="col l11 m12">
<h1>Согласие на обработку персональных данных</h1>
<p>Я, cвоей волей и в своем интересе даю согласие на обработку, в том числе на сбор, систематизацию, накопление, хранение (уточнение, обновление, изменение), использование, обезличивание, блокирование и уничтожение моих персональных данных &ndash; фамилии, имени, отчества, адреса доставки, номера контактного телефона, адреса электронной почты, Стремецкому Михаилу Викторовичу (именуемому в дальнейшем &laquo;Продавец&raquo;), расположенному по адресу: 350040, Россия, Краснодарский край, г. Краснодар, ул. Бургасская, 4 с целью продажи (предоставления) мне товаров и услуг (продуктов), осуществления доставки, предоставления сервисных услуг, получения обратной связи.</p>
<p>Подтверждаю, что персональные данные и иные сведения, относящиеся ко мне (фамилия, имя, отчество, адрес доставки, номер контактного телефона, адрес электронной почты) предоставлены Продавцу мною добровольно и являются достоверными путем внесения их при регистрации на сайте бурый-медведь.рф или по телефону в устной беседе . Я извещен о том, что в случае недостоверности предоставленных персональных и сведений Продавец оставляет за собой право прекратить обслуживание посредством сайта бурый-медведь.рф.</p>
<p>Я согласен, что мои персональные данные будут обрабатываться способами, соответствующими целям обработки персональных данных, без возможности принятия решения на основании исключительно автоматизированной обработки моих персональных данных.</p>
<p>Согласие дается мной с момента регистрации или оформления заказа на сайте бурый-медведь.рф</p>
<p>Настоящее согласие может быть отозвано мной в любой момент путем направления письменного требования в адрес Продавца. Адрес электронной почты Продавца: brownbear23@mail.ru</p>
</div>
<div class="col l11 m12 offset-l1">
<h2>Политика в отношении обработки персональных данных</h2>
<h3>1. ОСНОВНЫЕ ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ:</h3>
<p>В настоящей политике используются следующие основные понятия:</p>
<ul class="browser-default">
<li>персональные данные - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных);</li>
<li>оператор &ndash; Интернет-ресурс BrownBear, именуемый далее Сайт, самостоятельно организующий и осуществляющий обработку персональных данных, а также определяющий цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</li>
<li>обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</li>
<li>автоматизированная обработка персональных данных - обработка персональных данных с помощью средств вычислительной техники;</li>
<li>распространение персональных данных - действия, направленные на раскрытие персональных данных неопределенному кругу лиц;</li>
<li>предоставление персональных данных - действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;</li>
<li>блокирование персональных данных - временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);</li>
<li>уничтожение персональных данных - действия, в результате которых становится невозможным восстановить содержание персональных данных в информационной системе персональных данных и (или) в результате которых уничтожаются материальные носители персональных данных;</li>
<li>обезличивание персональных данных - действия, в результате которых становится невозможным без использования дополнительной информации определить принадлежность персональных данных конкретному субъекту персональных данных;</li>
<li>информационная система персональных данных - совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств;</li>
<li>трансграничная передача персональных данных - передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому лицу или иностранному юридическому лицу.</li>
</ul>
</div>
<div class="col l11 m12">
<h3>2. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
<p>Сайт, основываясь на целях безусловного выполнения требований законодательства РФ и поддержания своей деловой репутации, считает своими задачами исполнение принципов справедливости, законности, конфиденциальности, безопасности при обработке персональных данных.</p>
<p>Настоящая политика в отношении обработки персональных данных: - разработана с учетом требований Конституции РФ, законодательства Российской Федерации, нормативных правовых актов Российской Федерации в области персональных данных;</p>
<ul class="browser-default">
<li>определяет основные принципы, цели и способы обработки персональных данных, состав субъектов персональных данных и их права, действия Сайта при обработке персональных данных, меры, принимаемые по защите персональных данных, а также меры по контролю за соблюдением требований законодательства и данной политики;</li>
<li>является общедоступным документом, которым регулируется деятельность Сайта при обработке персональных данных.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>3. ИНФОРМАЦИЯ ОБ ОПЕРАТОРЕ</h3>
<table class="material-table">
<tbody>
<tr>
<td>ИНН</td>
<td><strong>800302612330</strong></td>
</tr>
<tr>
<td>Юрид. адрес</td>
<td><strong>350040, Россия, Краснодарский край, г. Краснодар, ул. Бургасская, 4</strong></td>
</tr>
<tr>
<td>Телефон</td>
<td><strong>+7 (918) 077-5831</strong></td>
</tr>
<tr>
<td>Дополнительный телефон</td>
<td><strong>+7 (918) 634-3486</strong></td>
</tr>
<tr>
<td>E-mail</td>
<td><strong>brownbear23@mail.ru</strong></td>
</tr>
</tbody>
</table>
</div>
<div class="col l11 m12">
<h3>4. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Данная политика в отношении обработки персональных данных составлена в соответствии с требованиями следующих нормативно-правовых актов РФ:</p>
<ul class="browser-default">
<li>Конституции Российской Федерации;</li>
<li>Федерального закона от 27 июля 2006 года №152-ФЗ &laquo;О персональных данных&raquo;;</li>
<li>Указа Президента Российской Федерации от 06 марта 1997 г. № 188 &laquo;Об утверждении Перечня сведений конфиденциального характера&raquo;;</li>
<li>постановления Правительства Российской Федерации от 13 сентября 2008 года №687 &laquo;Об утверждении Положения об особенностях обработки персональных данных, осуществляемой без использования средств автоматизации&raquo;;</li>
<li>постановления Правительства Российской Федерации от 01 ноября 2012 года №1119 &laquo;Об утверждении требований к защите персональных данных при их обработке в информационных системах персональных данных&raquo;;</li>
<li>приказа ФСТЭК России от 18 февраля 2013 г. №21 &laquo;Об утверждении состава и содержания организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных&raquo;;</li>
<li>приказа Роскомнадзора от 05 сентября 2013 №996 &laquo;Об утверждении требований и методов по обезличиванию персональных данных&raquo;;</li>
<li>иных нормативно-правовых актов Российской Федерации и нормативных документов уполномоченных органов государственной власти.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>5. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Сайт обрабатывает персональные данные исключительно в целях:</p>
<ul class="browser-default">
<li>осуществления хозяйственной деятельности, направленной на извлечение прибыли путем розничной продажи товаров (в частности питьевой воды, оборудования для розлива воды, фильтров для воды, одноразовой посуды и др.).</li>
<li>оказание экспедиционных и транспортных услуг, необходимых для реализации продукции; организации гарантийного сервисного обслуживания;</li>
<li>оказания снабженческих, сбытовых, юридических, финансовых, информационно-консультационных и маркетинговых услуг;</li>
<li>исполнения договора, одной из сторон (либо выгодоприобретателем) которого является субъект персональных данных (включая трудовые отношения с работниками Оператора, отношения с контрагентами/поставщиками и с покупателями/клиентами Оператора).</li>
</ul>
</div>
<div class="col l11 m12">
<h3>6. СУБЪЕКТЫ И КАТЕГОРИИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>В информационных системах персональных данных Сайта обрабатываются персональные данные следующих субъектов персональных данных:</p>
<ul class="browser-default">
<li>штатных и нештатных работников, состоящих в трудовых/договорных отношениях с Интернет- магазином и/или их близкие родственники;</li>
<li>физических лиц - покупателей/клиентов Сайта;</li>
<li>физических лиц - контрагентов по договорам, заключенным Сайтом.</li>
<li>граждан, обратившиеся с жалобами, заявлениями, их законные представители;</li>
<li>граждан, направившие резюме при устройстве на работу, а так же соискатели заполнившие анкету для участия в конкурсе на замещение вакантных должностей.</li>
<li>Сайт осуществляет обработку следующих категорий персональных данных общей категории: фамилия, имя, отчество, адрес доставки, контактные данные (номера телефонов, адреса электронной почты), учредительные документы, реквизиты доверенности или иного документа, подтверждающие полномочия, дата рождения, месяц рождения, год рождения, место рождения, данные документов, удостоверяющих личность, адрес (регистрации по месту жительства и фактического проживания).</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>7. ОСНОВНЫЕ ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Обработка персональных данных на Сайте ведется с учетом обеспечения защиты прав и свобод как работников Сайта так и иных лиц при обработке их персональных данных, в том числе прав на неприкосновенность частной жизни, личную и семейную тайну на основе принципов:</p>
<ul class="browser-default">
<li>законности и справедливости обработки персональных данных;</li>
<li>ограничения обработки персональных данных достижением конкретных, заранее определенных и законных целей;</li>
<li>соответствия целей и способов обработки персональных данных тем целям, которые были заявлены при сборе данных;</li>
<li>недопустимости объединения баз данных, созданных с разными целями для обработки персональных данных;</li>
<li>соответствия необходимости и достаточности объема, характера и способов обработки персональных данных заявленным целям их обработки;</li>
<li>обеспечения точности, достоверности и, при необходимости, актуальности по отношению к целям обработки;</li>
<li>хранения персональных данных в форме, позволяющей определить субъекта персональных данных не дольше, чем того требуют цели обработки, требования законодательства или договора, по которому выгодоприобретателем является субъект персональных данных;</li>
<li>уничтожения или обезличивания персональных данных по достижении целей или утраты необходимости в достижении этих целей, если иное не предусмотрено требованиями законодательства.</li>
</ul>
</div>
<div class="col l11 m12">
<h3>8. ДЕЙСТВИЯ С ПЕРСОНАЛЬНЫМИ ДАННЫМИ</h3>
<p>Сайт осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
<p>В Сайте обработка персональных данных осуществляется следующими способами:</p>
<ul class="browser-default">
<li>автоматизированная обработка персональных данных;</li>
<li>неавтоматизированная обработка персональных данных;</li>
<li>смешанная обработка персональных данных.</li>
</ul>
</div>
<div class="col l11 m12 offset-l1">
<h3>9. МЕРЫ ПО ВЫПОЛНЕНИЮ ОБЯЗАННОСТЕЙ САЙТА В ОБЕСПЕЧЕНИИ БЕЗОПАСНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПРИ ИХ ОБРАБОТКЕ</h3>
<p>Носители информации, содержащие персональные данные, хранятся в специальных строго контролируемых помещениях, расположенных в пределах границ контролируемых и охраняемых зон. Помещения, где хранятся персональные данные, и технические средства, с помощью которых производится обработка персональных данных, находятся под круглосуточной охраной и видеонаблюдением.</p>
<p>Информационный доступ к техническим средствам, с помощью которых производится обработка персональных данных, реализован через автоматизированные рабочие места, защищенные от несанкционированного доступа. В зависимости от степени критичности информации разграничение (ограничение) доступа проводится программно-аппаратными средствами идентификации и аутентификации пользователей.</p>
<p>Разграничен (ограничен) доступ персонала и посторонних лиц в защищаемые помещения и помещения, где размещены средства информатизации и коммуникации, а также где хранятся носители с персональными данными.</p>
<p>Информация доступна лишь для строго определенных работников. Производится запись (логирование) входа/выхода работников в/из операционную(ой) систему(ы), работы в автоматизированных рабочих местах, доступа к базам данных.</p>
<p>Реализована защита информации от сбоев оборудования и вредоносного программного обеспечения. Применяется система восстановления информации.</p>
<p>При работе в сетях безопасность информации обеспечивается средствами межсетевого экранирования, созданием демилитаризованных зон, виртуальных частных сетей, защищенных каналов связи, применением защищенных протоколов передачи информации и программно-аппаратных средств шифрования информации.</p>
</div>
<div class="col l11 m12">
<h3>10. ОТВЕТСТВЕННОСТЬ И КОНТРОЛЬ ЗА СОБЛЮДЕНИЕМ ТРЕБОВАНИЙ НАСТОЯЩЕЙ ПОЛИТИКИ И ЗАКОНОДАТЕЛЬСТВА В ОБЛАСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Ответственным за соблюдением требований законодательства в области персональных данных и настоящей политики является старший менеджер Сайта.</p>
<p>Лицо, ответственное за организацию и обеспечение безопасности персональных данных, в рамках выполнения положений настоящей политики и законных актов Российской Федерации в области персональных данных уполномочено:</p>
<ul class="browser-default">
<li>определять угрозы безопасности персональных данных при их обработке в информационных системах персональных данных;</li>
<li>планировать применение организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных, необходимых для противодействия угрозам безопасности персональных данных и выполнения требований к защите персональных данных;</li>
<li>организовывать контроль и/или аудит соответствия принятых мер защиты при обработке персональных данных Федеральному закону от 27.07.2006 №152-ФЗ &laquo;О персональных данных&raquo;, нормативным правовым актам, требованиям нормативных актов к защите персональных данных, локальным актам;</li>
<li>оценивать эффективность принимаемых мер по обеспечению безопасности персональных данных до ввода в эксплуатацию информационной системы персональных данных и организовывать мониторинг уровня защищенности персональных данных при эксплуатации информационной системы персональных данных;</li>
<li>проводить анализ по фактам нарушения положений настоящей политики; разрабатывать и принимать соответствующие меры на поддержание необходимого уровня защищенности персональных данных;</li>
<li>организовывать прием и обработку обращений и запросов регулирующих органов РФ, субъектов персональных данных или их представителей.</li>
</ul>
<p>Лица, виновные в нарушении норм действующего законодательства Российской Федерации в области персональных данных могут быть привлечены к дисциплинарной, административной, гражданской и уголовной ответственности в порядке, установленном действующим законодательством Российской Федерации.</p>
</div>
<div class="col l11 m12 offset-l1">
<h3>11. ПРАВА СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
<p>Субъект персональных данных имеет право на получение информации об обработке его персональных данных на Сайте, в том числе содержащую:</p>
<ul class="browser-default">
<li>подтверждение факта обработки персональных данных;</li>
<li>правовое основание, цели и сроки обработки персональных данных;</li>
<li>способы обработки персональных данных;</li>
<li>иные сведения, предусмотренные законодательством Российской Федерации.</li>
</ul>
<p>Право субъекта персональных данных на доступ к его персональным данным может быть ограничено:</p>
<ul class="browser-default">
<li>если обработка персональных данных, включая те, что получены в результате оперативно-розыскной деятельности, выполняется в целях укрепления обороны страны, обеспечения безопасности государства и охраны правопорядка;</li>
<li>легализации (отмыванию) доходов, полученных преступным путем, и финансированию терроризма если обработка персональных данных осуществляется в соответствии с законодательством о противодействии;</li>
<li>если доступ субъекта персональных данных нарушает права и законные интересы третьих лиц; при условии, что обработка персональных данных производится органами, осуществляющими задержание субъекта персональных данных по подозрению в совершении преступления, либо предъявившими субъекту персональных данных обвинение по уголовному делу, либо применившими к субъекту персональных данных меру пресечения до предъявления обвинения, за исключением предусмотренных уголовно-процессуальным законодательством Российской Федерации случаев, когда допускается ознакомление подозреваемого или обвиняемого с такими персональными данными;</li>
<li>если обработка персональных данных осуществляется в случаях, предусмотренных законодательством Российской Федерации о транспортной безопасности, в целях обеспечения устойчивого и безопасного функционирования транспортного комплекса, защиты интересов личности, общества и государства в сфере транспортного комплекса от актов незаконного вмешательства.</li>
</ul>
<p>Субъект персональных данных имеет право на:</p>
<ul class="browser-default">
<li>уточнение своих персональных данных, их блокирование или уничтожение, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки:</li>
<li>отзыв согласия на обработку персональных данных;</li>
<li>осуществление иных прав, предусмотренных законодательством Российской Федерации в области персональных данных.</li>
</ul>
<p>Для реализации своих прав и законных интересов субъект персональных данных может обратиться на Сайт.</p>
<p>Сайт рассматривает обращения и жалобы со стороны субъектов персональных данных, тщательно расследует факты нарушений и принимает все необходимые меры для их немедленного устранения, наказания виновных лиц и урегулирования спорных и конфликтных ситуации в досудебном порядке.</p>
<p>Субъект персональных данных вправе обжаловать действия или бездействие Сайта путем обращения в уполномоченных орган по защите прав субъектов персональных данных. Субъект персональных данных имеет право на защиту своих прав и законных интересов, в том числе в судебном порядке.</p>
</div>
<div class="col l11 m12">
<h3>12. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
<p>Настоящая политика разработана и утверждена Стремецким Михаилом Викторовичем</p>
<p>Настоящая Политика является внутренним документом Оператора, общедоступной и подлежит размещению на официальном сайте Оператора.</p>
<p>Настоящая Политика подлежит изменению, дополнению в случае появления новых законодательных актов и специальных нормативных документов по обработке и защите персональных данных Контроль исполнения требований настоящей Политики осуществляется ответственными за обеспечение безопасности персональных данных.</p>
<p>Ответственность должностных лиц Оператора, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных, определяется в соответствии с законодательством Российской Федерации и внутренними документами Оператора.</p>
</div>
</div>
            </div>
        </section>
        <section id="contacts" class="no-margin">
	<div class="row flex no-margin">
		<div class="col l6 m12 order-l1 form-wrapper">
			<form>
                <h2 class="styled">Свяжитесь с нами</h2>
                <div class="subheader">BrownBear – монтаж на высоте</div>
                <div><a href="https://yandex.ru/maps/-/CCU0nRx1pB">Краснодар, ул. Вишняковой, 1</a></div>
				<div>
					<ul>
						<li>Телефоны:</li>
                        [[!phones? &tpl=`phone`]]
					</ul>
				</div>
				<div><a href="mailto:brownbear23@mail.ru">brownbear23@mail.ru</a></div>
				<div class="row">
					<div class="col m6 s12">
						<div class="input-field"><input type="text" placeholder="Ваше имя" name="name"><label for="">Ваше имя</label><div class="indicator"></div></div>
					</div>
					<div class="col m6 s12">
						<div class="input-field"><input type="tel" placeholder="Ваш телефон" name="phone"><label for="">Ваш телефон</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="input-field"><textarea cols="30" rows="0" placeholder="Текст сообщения" name="comment"></textarea><label for="">Текст сообщения</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="check-agree">
							<input type="checkbox" id="agree_bottom" name="agree">
							<label for="agree_bottom">
								<div>
									Я даю своё согласие на сбор и обработку моих персональных данных согласно <a href="/policy.html">Политике конфиденциальности</a> и <a href="/agreement.html">Пользовательскому соглашению</a>
								</div>
							</label>
						</div>
					</div>
					<div class="col s12">
						<div class="align-right-m-up align-center-m-down">
							<a href="#!" class="bttn send-message">Отправить</a>
						</div>
					</div>
				</div>
			</form>
		</div>
		<div class="col l6 m12 no-padding">
			<div id="map" data-lon="45.011765" data-lat="38.992372" data-zoom="16"></div>
		</div>
	</div>
</section>
    </main>
    <footer>
    <div class="container">
        <div class="row flex">
            <div class="col xl2 l2 m4 s12">
                <img alt="" class="lazy responsive-img" data-src="/img/footer-logo.svg">
            </div>
            <div class="col xl10 l10 m8 s12">
                <div class="row">
                    <div class="col xl2 l3 m4 s4">
                        <div class="footer-header">Навигация</div>
                        [[!Wayfinder?
                            &startId=`0`
                            &level=`1`
                        ]]
                    </div>
                    <div class="col xl4 l4 m8 s8">
                        <div class="footer-header">Контакты</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://yandex.ru/maps/-/CCU0nRx1pB"><i class="mdi mdi-map-marker"></i><span>Краснодар, ул. Вишняковой, 1</span></a></li>
                            <li><a href="tel://+79180775831"><i class="mdi mdi-phone"></i><span>+7 (918) 077-5831</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://wa.me/+79180775831"><i class="mdi mdi-whatsapp"></i><span>WhatsApp</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>
                            <li><a href="mailto:brownbear23@mail.ru"><i class="mdi mdi-email-outline"></i><span>brownbear23@mail.ru</span></a></li>
                        </ul>
                    </div>
                    <div class="col xl4 l3 m8 s8">
                        <div class="footer-header">Документы</div>
                        [[!Wayfinder?
                            &startId=`22`
                        ]]
                    </div>
                    <div class="col xl2 l2 m4 s4">
                        <div class="footer-header">Соц.сети</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://www.youtube.com/@BrownBearPromAlp"><i class="mdi mdi-youtube"></i><span>Youtube</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://vk.com/brownbear23"><i class="mdi mdi-vk"></i><span>ВКонтакте</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://www.instagram.com/brownbear.23"><i class="mdi mdi-instagram"></i><span>Instagram</span></a></li>
                            <!--<li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>-->
                        </ul>
                    </div>
                </div>
            </div>
            <div class="col s12">
                <div class="media-networks-wrapper">
                    <div class="media-networks center-align">
                        <a href="https://wa.me/+79180775831" class="network"><i class="whatsapp"></i><span>WhatsApp</span></a>
                        <a href="https://t.me/+79180775831" class="network"><i class="telegram"></i><span>Telegram</span></a>
                        <a href="mailto://brownbear23@mail.ru" class="network"><i class="email"></i><span>E-mail</span></a>
                    </div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col s12 center-align">
                © BrownBear, 2023
            </div>
        </div>
    </div>
</footer>

    <script src="/js/master.js"></script>
</body>
</html>',
    '_isForward' => false,
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '.html',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[$head]]' => '<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>BrownBear – монтаж на высоте || Согласие на сбор и обработку персональных данных</title>
<link rel="stylesheet" href="/css/master.css">
<link rel="stylesheet" href="/css/pages/.css">

<link rel="apple-touch-icon" sizes="180x180" href="/img/favico/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/img/favico/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/img/favico/favicon-16x16.png">
<link rel="manifest" href="/img/favico/site.webmanifest">
<link rel="mask-icon" href="/img/favico/safari-pinned-tab.svg" color="#5bbad5">
<link rel="shortcut icon" href="/img/favico/favicon.ico">
<meta name="msapplication-TileColor" content="#3c3c3c">
<meta name="msapplication-config" content="/img/favico/browserconfig.xml">
<meta name="theme-color" content="#ffffff">',
    '[[$header]]' => '<header>
	<nav class="top">
		<div class="container">
			<ul>
				<li><a href="#mobile" class="mdi mdi-menu burger sidenav-trigger"></a></li>
				<li><a href="/" class="logo"></a></li>
			</ul>
			[[!Wayfinder?
			    &startId=`0`
			    &excludeDocs=`1`
			    &outerTpl=`@CODE <ul class="menu">[[+wf.wrapper]]</ul>`
			    &innerTpl=`@CODE <div class="submenu"><ul class="container">[[+wf.wrapper]]</ul></div>`
			]]
			<div class="separator"></div>
			<ul>
				<li class="phone">
					<a href="tel://+79180775831" class="phone">
						<i class="mdi mdi-phone"></i>
						<span>+7 (918) 077-5831</span>
					</a>
				</li>
				<li class="nav-icon"><a href="https://t.me/+79180775831" class="mdi mdi-telegram"></a></li>
				<li class="nav-icon"><a href="https://wa.me/+79180775831" class="mdi mdi-whatsapp"></a></li>
			</ul>
		</div>
	</nav>
</header>
[[!Wayfinder? 
    &startId=`0` 
    &outerTpl=`@CODE <ul class="sidenav" id="mobile">[[+wf.wrapper]]</ul>`
    &innerTpl=`@CODE <ul>[[+wf.wrapper]]</ul>`
]]',
    '[[$contacts-section]]' => '<section id="contacts" class="no-margin">
	<div class="row flex no-margin">
		<div class="col l6 m12 order-l1 form-wrapper">
			<form>
                <h2 class="styled">Свяжитесь с нами</h2>
                <div class="subheader">BrownBear – монтаж на высоте</div>
                <div><a href="https://yandex.ru/maps/-/CCU0nRx1pB">Краснодар, ул. Вишняковой, 1</a></div>
				<div>
					<ul>
						<li>Телефоны:</li>
                        [[!phones? &tpl=`phone`]]
					</ul>
				</div>
				<div><a href="mailto:brownbear23@mail.ru">brownbear23@mail.ru</a></div>
				<div class="row">
					<div class="col m6 s12">
						<div class="input-field"><input type="text" placeholder="Ваше имя" name="name"><label for="">Ваше имя</label><div class="indicator"></div></div>
					</div>
					<div class="col m6 s12">
						<div class="input-field"><input type="tel" placeholder="Ваш телефон" name="phone"><label for="">Ваш телефон</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="input-field"><textarea cols="30" rows="0" placeholder="Текст сообщения" name="comment"></textarea><label for="">Текст сообщения</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="check-agree">
							<input type="checkbox" id="agree_bottom" name="agree">
							<label for="agree_bottom">
								<div>
									Я даю своё согласие на сбор и обработку моих персональных данных согласно <a href="/policy.html">Политике конфиденциальности</a> и <a href="/agreement.html">Пользовательскому соглашению</a>
								</div>
							</label>
						</div>
					</div>
					<div class="col s12">
						<div class="align-right-m-up align-center-m-down">
							<a href="#!" class="bttn send-message">Отправить</a>
						</div>
					</div>
				</div>
			</form>
		</div>
		<div class="col l6 m12 no-padding">
			<div id="map" data-lon="45.011765" data-lat="38.992372" data-zoom="16"></div>
		</div>
	</div>
</section>',
    '[[$footer]]' => '<footer>
    <div class="container">
        <div class="row flex">
            <div class="col xl2 l2 m4 s12">
                <img alt="" class="lazy responsive-img" data-src="/img/footer-logo.svg">
            </div>
            <div class="col xl10 l10 m8 s12">
                <div class="row">
                    <div class="col xl2 l3 m4 s4">
                        <div class="footer-header">Навигация</div>
                        [[!Wayfinder?
                            &startId=`0`
                            &level=`1`
                        ]]
                    </div>
                    <div class="col xl4 l4 m8 s8">
                        <div class="footer-header">Контакты</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://yandex.ru/maps/-/CCU0nRx1pB"><i class="mdi mdi-map-marker"></i><span>Краснодар, ул. Вишняковой, 1</span></a></li>
                            <li><a href="tel://+79180775831"><i class="mdi mdi-phone"></i><span>+7 (918) 077-5831</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://wa.me/+79180775831"><i class="mdi mdi-whatsapp"></i><span>WhatsApp</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>
                            <li><a href="mailto:brownbear23@mail.ru"><i class="mdi mdi-email-outline"></i><span>brownbear23@mail.ru</span></a></li>
                        </ul>
                    </div>
                    <div class="col xl4 l3 m8 s8">
                        <div class="footer-header">Документы</div>
                        [[!Wayfinder?
                            &startId=`22`
                        ]]
                    </div>
                    <div class="col xl2 l2 m4 s4">
                        <div class="footer-header">Соц.сети</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://www.youtube.com/@BrownBearPromAlp"><i class="mdi mdi-youtube"></i><span>Youtube</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://vk.com/brownbear23"><i class="mdi mdi-vk"></i><span>ВКонтакте</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://www.instagram.com/brownbear.23"><i class="mdi mdi-instagram"></i><span>Instagram</span></a></li>
                            <!--<li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>-->
                        </ul>
                    </div>
                </div>
            </div>
            <div class="col s12">
                <div class="media-networks-wrapper">
                    <div class="media-networks center-align">
                        <a href="https://wa.me/+79180775831" class="network"><i class="whatsapp"></i><span>WhatsApp</span></a>
                        <a href="https://t.me/+79180775831" class="network"><i class="telegram"></i><span>Telegram</span></a>
                        <a href="mailto://brownbear23@mail.ru" class="network"><i class="email"></i><span>E-mail</span></a>
                    </div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col s12 center-align">
                © BrownBear, 2023
            </div>
        </div>
    </div>
</footer>
',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'head' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'head',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>[[++site_name]] || [[*pagetitle]]</title>
<link rel="stylesheet" href="/css/master.css">
<link rel="stylesheet" href="/css/pages/[[*style]].css">

<link rel="apple-touch-icon" sizes="180x180" href="/img/favico/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/img/favico/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/img/favico/favicon-16x16.png">
<link rel="manifest" href="/img/favico/site.webmanifest">
<link rel="mask-icon" href="/img/favico/safari-pinned-tab.svg" color="#5bbad5">
<link rel="shortcut icon" href="/img/favico/favicon.ico">
<meta name="msapplication-TileColor" content="#3c3c3c">
<meta name="msapplication-config" content="/img/favico/browserconfig.xml">
<meta name="theme-color" content="#ffffff">',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>[[++site_name]] || [[*pagetitle]]</title>
<link rel="stylesheet" href="/css/master.css">
<link rel="stylesheet" href="/css/pages/[[*style]].css">

<link rel="apple-touch-icon" sizes="180x180" href="/img/favico/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/img/favico/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/img/favico/favicon-16x16.png">
<link rel="manifest" href="/img/favico/site.webmanifest">
<link rel="mask-icon" href="/img/favico/safari-pinned-tab.svg" color="#5bbad5">
<link rel="shortcut icon" href="/img/favico/favicon.ico">
<meta name="msapplication-TileColor" content="#3c3c3c">
<meta name="msapplication-config" content="/img/favico/browserconfig.xml">
<meta name="theme-color" content="#ffffff">',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'header' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'header',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<header>
	<nav class="top">
		<div class="container">
			<ul>
				<li><a href="#mobile" class="mdi mdi-menu burger sidenav-trigger"></a></li>
				<li><a href="/" class="logo"></a></li>
			</ul>
			[[!Wayfinder?
			    &startId=`0`
			    &excludeDocs=`1`
			    &outerTpl=`@CODE <ul class="menu">[[+wf.wrapper]]</ul>`
			    &innerTpl=`@CODE <div class="submenu"><ul class="container">[[+wf.wrapper]]</ul></div>`
			]]
			<div class="separator"></div>
			<ul>
				<li class="phone">
					<a href="tel://+79180775831" class="phone">
						<i class="mdi mdi-phone"></i>
						<span>+7 (918) 077-5831</span>
					</a>
				</li>
				<li class="nav-icon"><a href="https://t.me/+79180775831" class="mdi mdi-telegram"></a></li>
				<li class="nav-icon"><a href="https://wa.me/+79180775831" class="mdi mdi-whatsapp"></a></li>
			</ul>
		</div>
	</nav>
</header>
[[!Wayfinder? 
    &startId=`0` 
    &outerTpl=`@CODE <ul class="sidenav" id="mobile">[[+wf.wrapper]]</ul>`
    &innerTpl=`@CODE <ul>[[+wf.wrapper]]</ul>`
]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<header>
	<nav class="top">
		<div class="container">
			<ul>
				<li><a href="#mobile" class="mdi mdi-menu burger sidenav-trigger"></a></li>
				<li><a href="/" class="logo"></a></li>
			</ul>
			[[!Wayfinder?
			    &startId=`0`
			    &excludeDocs=`1`
			    &outerTpl=`@CODE <ul class="menu">[[+wf.wrapper]]</ul>`
			    &innerTpl=`@CODE <div class="submenu"><ul class="container">[[+wf.wrapper]]</ul></div>`
			]]
			<div class="separator"></div>
			<ul>
				<li class="phone">
					<a href="tel://+79180775831" class="phone">
						<i class="mdi mdi-phone"></i>
						<span>+7 (918) 077-5831</span>
					</a>
				</li>
				<li class="nav-icon"><a href="https://t.me/+79180775831" class="mdi mdi-telegram"></a></li>
				<li class="nav-icon"><a href="https://wa.me/+79180775831" class="mdi mdi-whatsapp"></a></li>
			</ul>
		</div>
	</nav>
</header>
[[!Wayfinder? 
    &startId=`0` 
    &outerTpl=`@CODE <ul class="sidenav" id="mobile">[[+wf.wrapper]]</ul>`
    &innerTpl=`@CODE <ul>[[+wf.wrapper]]</ul>`
]]',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contacts-section' => 
      array (
        'fields' => 
        array (
          'id' => 7,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'contacts-section',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<section id="contacts" class="no-margin">
	<div class="row flex no-margin">
		<div class="col l6 m12 order-l1 form-wrapper">
			<form>
                <h2 class="styled">Свяжитесь с нами</h2>
                <div class="subheader">[[++site_name]]</div>
                <div><a href="[[++address_link]]">[[++address]]</a></div>
				<div>
					<ul>
						<li>Телефоны:</li>
                        [[!phones? &tpl=`phone`]]
					</ul>
				</div>
				<div><a href="mailto:[[++email]]">[[++email]]</a></div>
				<div class="row">
					<div class="col m6 s12">
						<div class="input-field"><input type="text" placeholder="Ваше имя" name="name"><label for="">Ваше имя</label><div class="indicator"></div></div>
					</div>
					<div class="col m6 s12">
						<div class="input-field"><input type="tel" placeholder="Ваш телефон" name="phone"><label for="">Ваш телефон</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="input-field"><textarea cols="30" rows="0" placeholder="Текст сообщения" name="comment"></textarea><label for="">Текст сообщения</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="check-agree">
							<input type="checkbox" id="agree_bottom" name="agree">
							<label for="agree_bottom">
								<div>
									Я даю своё согласие на сбор и обработку моих персональных данных согласно <a href="/policy.html">Политике конфиденциальности</a> и <a href="/agreement.html">Пользовательскому соглашению</a>
								</div>
							</label>
						</div>
					</div>
					<div class="col s12">
						<div class="align-right-m-up align-center-m-down">
							<a href="#!" class="bttn send-message">Отправить</a>
						</div>
					</div>
				</div>
			</form>
		</div>
		<div class="col l6 m12 no-padding">
			<div id="map" data-lon="[[++lon]]" data-lat="[[++lat]]" data-zoom="[[++zoom]]"></div>
		</div>
	</div>
</section>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<section id="contacts" class="no-margin">
	<div class="row flex no-margin">
		<div class="col l6 m12 order-l1 form-wrapper">
			<form>
                <h2 class="styled">Свяжитесь с нами</h2>
                <div class="subheader">[[++site_name]]</div>
                <div><a href="[[++address_link]]">[[++address]]</a></div>
				<div>
					<ul>
						<li>Телефоны:</li>
                        [[!phones? &tpl=`phone`]]
					</ul>
				</div>
				<div><a href="mailto:[[++email]]">[[++email]]</a></div>
				<div class="row">
					<div class="col m6 s12">
						<div class="input-field"><input type="text" placeholder="Ваше имя" name="name"><label for="">Ваше имя</label><div class="indicator"></div></div>
					</div>
					<div class="col m6 s12">
						<div class="input-field"><input type="tel" placeholder="Ваш телефон" name="phone"><label for="">Ваш телефон</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="input-field"><textarea cols="30" rows="0" placeholder="Текст сообщения" name="comment"></textarea><label for="">Текст сообщения</label><div class="indicator"></div></div>
					</div>
					<div class="col s12">
						<div class="check-agree">
							<input type="checkbox" id="agree_bottom" name="agree">
							<label for="agree_bottom">
								<div>
									Я даю своё согласие на сбор и обработку моих персональных данных согласно <a href="/policy.html">Политике конфиденциальности</a> и <a href="/agreement.html">Пользовательскому соглашению</a>
								</div>
							</label>
						</div>
					</div>
					<div class="col s12">
						<div class="align-right-m-up align-center-m-down">
							<a href="#!" class="bttn send-message">Отправить</a>
						</div>
					</div>
				</div>
			</form>
		</div>
		<div class="col l6 m12 no-padding">
			<div id="map" data-lon="[[++lon]]" data-lat="[[++lat]]" data-zoom="[[++zoom]]"></div>
		</div>
	</div>
</section>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer' => 
      array (
        'fields' => 
        array (
          'id' => 8,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'footer',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<footer>
    <div class="container">
        <div class="row flex">
            <div class="col xl2 l2 m4 s12">
                <img alt="" class="lazy responsive-img" data-src="/img/footer-logo.svg">
            </div>
            <div class="col xl10 l10 m8 s12">
                <div class="row">
                    <div class="col xl2 l3 m4 s4">
                        <div class="footer-header">Навигация</div>
                        [[!Wayfinder?
                            &startId=`0`
                            &level=`1`
                        ]]
                    </div>
                    <div class="col xl4 l4 m8 s8">
                        <div class="footer-header">Контакты</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="[[++address_link]]"><i class="mdi mdi-map-marker"></i><span>[[++address]]</span></a></li>
                            <li><a href="tel://+79180775831"><i class="mdi mdi-phone"></i><span>+7 (918) 077-5831</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://wa.me/+79180775831"><i class="mdi mdi-whatsapp"></i><span>WhatsApp</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>
                            <li><a href="mailto:[[++email]]"><i class="mdi mdi-email-outline"></i><span>[[++email]]</span></a></li>
                        </ul>
                    </div>
                    <div class="col xl4 l3 m8 s8">
                        <div class="footer-header">Документы</div>
                        [[!Wayfinder?
                            &startId=`22`
                        ]]
                    </div>
                    <div class="col xl2 l2 m4 s4">
                        <div class="footer-header">Соц.сети</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://www.youtube.com/@BrownBearPromAlp"><i class="mdi mdi-youtube"></i><span>Youtube</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://vk.com/brownbear23"><i class="mdi mdi-vk"></i><span>ВКонтакте</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://www.instagram.com/brownbear.23"><i class="mdi mdi-instagram"></i><span>Instagram</span></a></li>
                            <!--<li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>-->
                        </ul>
                    </div>
                </div>
            </div>
            <div class="col s12">
                <div class="media-networks-wrapper">
                    <div class="media-networks center-align">
                        <a href="https://wa.me/+79180775831" class="network"><i class="whatsapp"></i><span>WhatsApp</span></a>
                        <a href="https://t.me/+79180775831" class="network"><i class="telegram"></i><span>Telegram</span></a>
                        <a href="mailto://[[++email]]" class="network"><i class="email"></i><span>E-mail</span></a>
                    </div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col s12 center-align">
                © BrownBear, 2023
            </div>
        </div>
    </div>
</footer>
',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<footer>
    <div class="container">
        <div class="row flex">
            <div class="col xl2 l2 m4 s12">
                <img alt="" class="lazy responsive-img" data-src="/img/footer-logo.svg">
            </div>
            <div class="col xl10 l10 m8 s12">
                <div class="row">
                    <div class="col xl2 l3 m4 s4">
                        <div class="footer-header">Навигация</div>
                        [[!Wayfinder?
                            &startId=`0`
                            &level=`1`
                        ]]
                    </div>
                    <div class="col xl4 l4 m8 s8">
                        <div class="footer-header">Контакты</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="[[++address_link]]"><i class="mdi mdi-map-marker"></i><span>[[++address]]</span></a></li>
                            <li><a href="tel://+79180775831"><i class="mdi mdi-phone"></i><span>+7 (918) 077-5831</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://wa.me/+79180775831"><i class="mdi mdi-whatsapp"></i><span>WhatsApp</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>
                            <li><a href="mailto:[[++email]]"><i class="mdi mdi-email-outline"></i><span>[[++email]]</span></a></li>
                        </ul>
                    </div>
                    <div class="col xl4 l3 m8 s8">
                        <div class="footer-header">Документы</div>
                        [[!Wayfinder?
                            &startId=`22`
                        ]]
                    </div>
                    <div class="col xl2 l2 m4 s4">
                        <div class="footer-header">Соц.сети</div>
                        <ul>
                            <li><a target="_blank" rel="nofollow" href="https://www.youtube.com/@BrownBearPromAlp"><i class="mdi mdi-youtube"></i><span>Youtube</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://vk.com/brownbear23"><i class="mdi mdi-vk"></i><span>ВКонтакте</span></a></li>
                            <li><a target="_blank" rel="nofollow" href="https://www.instagram.com/brownbear.23"><i class="mdi mdi-instagram"></i><span>Instagram</span></a></li>
                            <!--<li><a target="_blank" rel="nofollow" href="https://t.me/+79180775831"><i class="mdi mdi-telegram"></i><span>Telegram</span></a></li>-->
                        </ul>
                    </div>
                </div>
            </div>
            <div class="col s12">
                <div class="media-networks-wrapper">
                    <div class="media-networks center-align">
                        <a href="https://wa.me/+79180775831" class="network"><i class="whatsapp"></i><span>WhatsApp</span></a>
                        <a href="https://t.me/+79180775831" class="network"><i class="telegram"></i><span>Telegram</span></a>
                        <a href="mailto://[[++email]]" class="network"><i class="email"></i><span>E-mail</span></a>
                    </div>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col s12 center-align">
                © BrownBear, 2023
            </div>
        </div>
    </div>
</footer>
',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'phone' => 
      array (
        'fields' => 
        array (
          'id' => 9,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'phone',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<li><a href=\\"tel://[[+link]]\\">• [[+num]]</li>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<li><a href=\\"tel://[[+link]]\\">• [[+num]]</li>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'Wayfinder' => 
      array (
        'fields' => 
        array (
          'id' => 32,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'Wayfinder',
          'description' => 'Wayfinder for MODx Revolution 2.0.0-beta-5 and later.',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '/**
 * Wayfinder Snippet to build site navigation menus
 *
 * Totally refactored from original DropMenu nav builder to make it easier to
 * create custom navigation by using chunks as output templates. By using
 * templates, many of the paramaters are no longer needed for flexible output
 * including tables, unordered- or ordered-lists (ULs or OLs), definition lists
 * (DLs) or in any other format you desire.
 *
 * @version 2.1.1-beta5
 * @author Garry Nutting (collabpad.com)
 * @author Kyle Jaebker (muddydogpaws.com)
 * @author Ryan Thrash (modx.com)
 * @author Shaun McCormick (modx.com)
 * @author Jason Coward (modx.com)
 *
 * @example [[Wayfinder? &startId=`0`]]
 *
 * @var modX $modx
 * @var array $scriptProperties
 * 
 * @package wayfinder
 */
$wayfinder_base = $modx->getOption(\'wayfinder.core_path\',$scriptProperties,$modx->getOption(\'core_path\').\'components/wayfinder/\');

/* include a custom config file if specified */
if (isset($scriptProperties[\'config\'])) {
    $scriptProperties[\'config\'] = str_replace(\'../\',\'\',$scriptProperties[\'config\']);
    $scriptProperties[\'config\'] = $wayfinder_base.\'configs/\'.$scriptProperties[\'config\'].\'.config.php\';
} else {
    $scriptProperties[\'config\'] = $wayfinder_base.\'configs/default.config.php\';
}
if (file_exists($scriptProperties[\'config\'])) {
    include $scriptProperties[\'config\'];
}

/* include wayfinder class */
include_once $wayfinder_base.\'wayfinder.class.php\';
if (!$modx->loadClass(\'Wayfinder\',$wayfinder_base,true,true)) {
    return \'error: Wayfinder class not found\';
}
$wf = new Wayfinder($modx,$scriptProperties);

/* get user class definitions
 * TODO: eventually move these into config parameters */
$wf->_css = array(
    \'first\' => isset($firstClass) ? $firstClass : \'\',
    \'last\' => isset($lastClass) ? $lastClass : \'last\',
    \'here\' => isset($hereClass) ? $hereClass : \'active\',
    \'parent\' => isset($parentClass) ? $parentClass : \'\',
    \'row\' => isset($rowClass) ? $rowClass : \'\',
    \'outer\' => isset($outerClass) ? $outerClass : \'\',
    \'inner\' => isset($innerClass) ? $innerClass : \'\',
    \'level\' => isset($levelClass) ? $levelClass: \'\',
    \'self\' => isset($selfClass) ? $selfClass : \'\',
    \'weblink\' => isset($webLinkClass) ? $webLinkClass : \'\'
);

/* get user templates
 * TODO: eventually move these into config parameters */
$wf->_templates = array(
    \'outerTpl\' => isset($outerTpl) ? $outerTpl : \'\',
    \'rowTpl\' => isset($rowTpl) ? $rowTpl : \'\',
    \'parentRowTpl\' => isset($parentRowTpl) ? $parentRowTpl : \'\',
    \'parentRowHereTpl\' => isset($parentRowHereTpl) ? $parentRowHereTpl : \'\',
    \'hereTpl\' => isset($hereTpl) ? $hereTpl : \'\',
    \'innerTpl\' => isset($innerTpl) ? $innerTpl : \'\',
    \'innerRowTpl\' => isset($innerRowTpl) ? $innerRowTpl : \'\',
    \'innerHereTpl\' => isset($innerHereTpl) ? $innerHereTpl : \'\',
    \'activeParentRowTpl\' => isset($activeParentRowTpl) ? $activeParentRowTpl : \'\',
    \'categoryFoldersTpl\' => isset($categoryFoldersTpl) ? $categoryFoldersTpl : \'\',
    \'startItemTpl\' => isset($startItemTpl) ? $startItemTpl : \'\'
);

/* process Wayfinder */
$output = $wf->run();
if ($wf->_config[\'debug\']) {
    $output .= $wf->renderDebugOutput();
}

/* output results */
if ($wf->_config[\'ph\']) {
    $modx->setPlaceholder($wf->_config[\'ph\'],$output);
} else {
    return $output;
}',
          'locked' => false,
          'properties' => 
          array (
            'level' => 
            array (
              'name' => 'level',
              'desc' => 'prop_wayfinder.level_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '0',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Depth (number of levels) to build the menu from. 0 goes through all levels.',
              'area' => '',
              'area_trans' => '',
            ),
            'includeDocs' => 
            array (
              'name' => 'includeDocs',
              'desc' => 'prop_wayfinder.includeDocs_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '0',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Acts as a filter and will limit the output to only the documents specified in this parameter. The startId is still required.',
              'area' => '',
              'area_trans' => '',
            ),
            'excludeDocs' => 
            array (
              'name' => 'excludeDocs',
              'desc' => 'prop_wayfinder.excludeDocs_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '0',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Acts as a filter and will remove the documents specified in this parameter from the output. The startId is still required.',
              'area' => '',
              'area_trans' => '',
            ),
            'contexts' => 
            array (
              'name' => 'contexts',
              'desc' => 'prop_wayfinder.contexts_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Specify the contexts for the Resources that will be loaded in this menu. Useful when used with startId at 0 to show all first-level items. Note: This will increase load times a bit, but if you set cacheResults to 1, that will offset the load time.',
              'area' => '',
              'area_trans' => '',
            ),
            'cacheResults' => 
            array (
              'name' => 'cacheResults',
              'desc' => 'prop_wayfinder.cacheResults_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => true,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Cache the generated menu to the MODX Resource cache. Setting this to 1 will speed up the loading of your menus.',
              'area' => '',
              'area_trans' => '',
            ),
            'cacheTime' => 
            array (
              'name' => 'cacheTime',
              'desc' => 'prop_wayfinder.cacheTime_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 3600,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'The number of seconds to store the cached menu, if cacheResults is 1. Set to 0 to store indefinitely until cache is manually cleared.',
              'area' => '',
              'area_trans' => '',
            ),
            'ph' => 
            array (
              'name' => 'ph',
              'desc' => 'prop_wayfinder.ph_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'To display send the output of Wayfinder to a placeholder set the ph parameter equal to the name of the desired placeholder. All output including the debugging (if on) will be sent to the placeholder specified.',
              'area' => '',
              'area_trans' => '',
            ),
            'debug' => 
            array (
              'name' => 'debug',
              'desc' => 'prop_wayfinder.debug_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'With the debug parameter set to 1, Wayfinder will output information on how each Resource was processed.',
              'area' => '',
              'area_trans' => '',
            ),
            'ignoreHidden' => 
            array (
              'name' => 'ignoreHidden',
              'desc' => 'prop_wayfinder.ignoreHidden_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'The ignoreHidden parameter allows Wayfinder to ignore the display in menu flag that can be set for each document. With this parameter set to 1, all Resources will be displayed regardless of the Display in Menu flag.',
              'area' => '',
              'area_trans' => '',
            ),
            'hideSubMenus' => 
            array (
              'name' => 'hideSubMenus',
              'desc' => 'prop_wayfinder.hideSubMenus_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'The hideSubMenus parameter will remove all non-active submenus from the Wayfinder output if set to 1. This parameter only works if multiple levels are being displayed.',
              'area' => '',
              'area_trans' => '',
            ),
            'useWeblinkUrl' => 
            array (
              'name' => 'useWeblinkUrl',
              'desc' => 'prop_wayfinder.useWeblinkUrl_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => true,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => ' If WebLinks are used in the output, Wayfinder will output the link specified in the WebLink instead of the normal MODx link. To use the standard display of WebLinks (like any other Resource) set this to 0.',
              'area' => '',
              'area_trans' => '',
            ),
            'fullLink' => 
            array (
              'name' => 'fullLink',
              'desc' => 'prop_wayfinder.fullLink_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'If set to 1, will display the entire, absolute URL in the link. (It is recommended to use scheme instead.)',
              'area' => '',
              'area_trans' => '',
            ),
            'scheme' => 
            array (
              'name' => 'scheme',
              'desc' => 'prop_wayfinder.scheme_desc',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'prop_wayfinder.relative',
                  'value' => '',
                  'name' => 'Relative',
                ),
                1 => 
                array (
                  'text' => 'prop_wayfinder.absolute',
                  'value' => 'abs',
                  'name' => 'Absolute',
                ),
                2 => 
                array (
                  'text' => 'prop_wayfinder.full',
                  'value' => 'full',
                  'name' => 'Full',
                ),
              ),
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Determines how URLs are generated for each link. Set to "abs" to show the absolute URL, "full" to show the full URL, and blank to use the relative URL. Defaults to relative.',
              'area' => '',
              'area_trans' => '',
            ),
            'sortOrder' => 
            array (
              'name' => 'sortOrder',
              'desc' => 'prop_wayfinder.sortOrder_desc',
              'type' => 'list',
              'options' => 
              array (
                0 => 
                array (
                  'text' => 'prop_wayfinder.ascending',
                  'value' => 'ASC',
                  'name' => 'Ascending',
                ),
                1 => 
                array (
                  'text' => 'prop_wayfinder.descending',
                  'value' => 'DESC',
                  'name' => 'Descending',
                ),
              ),
              'value' => 'ASC',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Allows the menu to be sorted in either ascending or descending order.',
              'area' => '',
              'area_trans' => '',
            ),
            'sortBy' => 
            array (
              'name' => 'sortBy',
              'desc' => 'prop_wayfinder.sortBy_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'menuindex',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Sorts the output by any of the Resource fields on a level by level basis. This means that each submenu will be sorted independently of all other submenus at the same level. Random will sort the output differently every time the page is loaded if the snippet is called uncached.',
              'area' => '',
              'area_trans' => '',
            ),
            'limit' => 
            array (
              'name' => 'limit',
              'desc' => 'prop_wayfinder.limit_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '0',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Causes Wayfinder to only process the number of items specified per level.',
              'area' => '',
              'area_trans' => '',
            ),
            'cssTpl' => 
            array (
              'name' => 'cssTpl',
              'desc' => 'prop_wayfinder.cssTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'This parameter allows for a chunk containing a link to a style sheet or style information to be inserted into the head section of the generated page.',
              'area' => '',
              'area_trans' => '',
            ),
            'jsTpl' => 
            array (
              'name' => 'jsTpl',
              'desc' => 'prop_wayfinder.jsTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'This parameter allows for a chunk containing some Javascript to be inserted into the head section of the generated page.',
              'area' => '',
              'area_trans' => '',
            ),
            'rowIdPrefix' => 
            array (
              'name' => 'rowIdPrefix',
              'desc' => 'prop_wayfinder.rowIdPrefix_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'If set, Wayfinder will replace the id placeholder with a unique id consisting of the specified prefix plus the Resource id.',
              'area' => '',
              'area_trans' => '',
            ),
            'textOfLinks' => 
            array (
              'name' => 'textOfLinks',
              'desc' => 'prop_wayfinder.textOfLinks_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'menutitle',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'This field will be inserted into the linktext placeholder.',
              'area' => '',
              'area_trans' => '',
            ),
            'titleOfLinks' => 
            array (
              'name' => 'titleOfLinks',
              'desc' => 'prop_wayfinder.titleOfLinks_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'pagetitle',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'This field will be inserted into the linktitle placeholder.',
              'area' => '',
              'area_trans' => '',
            ),
            'displayStart' => 
            array (
              'name' => 'displayStart',
              'desc' => 'prop_wayfinder.displayStart_desc',
              'type' => 'combo-boolean',
              'options' => '',
              'value' => false,
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Show the document as referenced by startId in the menu.',
              'area' => '',
              'area_trans' => '',
            ),
            'firstClass' => 
            array (
              'name' => 'firstClass',
              'desc' => 'prop_wayfinder.firstClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'first',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the first item at a given menu level.',
              'area' => '',
              'area_trans' => '',
            ),
            'lastClass' => 
            array (
              'name' => 'lastClass',
              'desc' => 'prop_wayfinder.lastClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'last',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the last item at a given menu level.',
              'area' => '',
              'area_trans' => '',
            ),
            'hereClass' => 
            array (
              'name' => 'hereClass',
              'desc' => 'prop_wayfinder.hereClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'active',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the items showing where you are, all the way up the chain.',
              'area' => '',
              'area_trans' => '',
            ),
            'parentClass' => 
            array (
              'name' => 'parentClass',
              'desc' => 'prop_wayfinder.parentClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for menu items that are a container and have children.',
              'area' => '',
              'area_trans' => '',
            ),
            'rowClass' => 
            array (
              'name' => 'rowClass',
              'desc' => 'prop_wayfinder.rowClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class denoting each output row.',
              'area' => '',
              'area_trans' => '',
            ),
            'outerClass' => 
            array (
              'name' => 'outerClass',
              'desc' => 'prop_wayfinder.outerClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the outer template.',
              'area' => '',
              'area_trans' => '',
            ),
            'innerClass' => 
            array (
              'name' => 'innerClass',
              'desc' => 'prop_wayfinder.innerClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the inner template.',
              'area' => '',
              'area_trans' => '',
            ),
            'levelClass' => 
            array (
              'name' => 'levelClass',
              'desc' => 'prop_wayfinder.levelClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class denoting every output row level. The level number will be added to the specified class (level1, level2, level3 etc if you specified "level").',
              'area' => '',
              'area_trans' => '',
            ),
            'selfClass' => 
            array (
              'name' => 'selfClass',
              'desc' => 'prop_wayfinder.selfClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for the current item.',
              'area' => '',
              'area_trans' => '',
            ),
            'webLinkClass' => 
            array (
              'name' => 'webLinkClass',
              'desc' => 'prop_wayfinder.webLinkClass_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'CSS class for weblink items.',
              'area' => '',
              'area_trans' => '',
            ),
            'outerTpl' => 
            array (
              'name' => 'outerTpl',
              'desc' => 'prop_wayfinder.outerTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the outer most container; if not included, a string including "<ul>[[+wf.wrapper]]</ul>" is assumed.',
              'area' => '',
              'area_trans' => '',
            ),
            'rowTpl' => 
            array (
              'name' => 'rowTpl',
              'desc' => 'prop_wayfinder.rowTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the regular row items.',
              'area' => '',
              'area_trans' => '',
            ),
            'parentRowTpl' => 
            array (
              'name' => 'parentRowTpl',
              'desc' => 'prop_wayfinder.parentRowTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for any Resource that is a container and has children. Remember the [wf.wrapper] placeholder to output the children documents.',
              'area' => '',
              'area_trans' => '',
            ),
            'parentRowHereTpl' => 
            array (
              'name' => 'parentRowHereTpl',
              'desc' => 'prop_wayfinder.parentRowHereTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the current Resource if it is a container and has children. Remember the [wf.wrapper] placeholder to output the children documents.',
              'area' => '',
              'area_trans' => '',
            ),
            'hereTpl' => 
            array (
              'name' => 'hereTpl',
              'desc' => 'prop_wayfinder.hereTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the current Resource.',
              'area' => '',
              'area_trans' => '',
            ),
            'innerTpl' => 
            array (
              'name' => 'innerTpl',
              'desc' => 'prop_wayfinder.innerTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for each submenu. If no innerTpl is specified the outerTpl is used in its place.',
              'area' => '',
              'area_trans' => '',
            ),
            'innerRowTpl' => 
            array (
              'name' => 'innerRowTpl',
              'desc' => 'prop_wayfinder.innerRowTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the row items in a subfolder.',
              'area' => '',
              'area_trans' => '',
            ),
            'innerHereTpl' => 
            array (
              'name' => 'innerHereTpl',
              'desc' => 'prop_wayfinder.innerHereTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the current Resource if it is in a subfolder.',
              'area' => '',
              'area_trans' => '',
            ),
            'activeParentRowTpl' => 
            array (
              'name' => 'activeParentRowTpl',
              'desc' => 'prop_wayfinder.activeParentRowTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for items that are containers, have children and are currently active in the tree.',
              'area' => '',
              'area_trans' => '',
            ),
            'categoryFoldersTpl' => 
            array (
              'name' => 'categoryFoldersTpl',
              'desc' => 'prop_wayfinder.categoryFoldersTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for category folders. Category folders are determined by setting the template to blank or by setting the link attributes field to rel="category".',
              'area' => '',
              'area_trans' => '',
            ),
            'startItemTpl' => 
            array (
              'name' => 'startItemTpl',
              'desc' => 'prop_wayfinder.startItemTpl_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Name of the chunk containing the template for the start item, if enabled via the &displayStart parameter. Note: the default template shows the start item but does not link it. If you do not need a link, a class can be applied to the default template using the parameter &firstClass=`className`.',
              'area' => '',
              'area_trans' => '',
            ),
            'permissions' => 
            array (
              'name' => 'permissions',
              'desc' => 'prop_wayfinder.permissions_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => 'list',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Will check for a permission on the Resource. Defaults to "list" - set to blank to skip normal permissions checks.',
              'area' => '',
              'area_trans' => '',
            ),
            'hereId' => 
            array (
              'name' => 'hereId',
              'desc' => 'prop_wayfinder.hereId_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Optional. If set, will change the "here" Resource to this ID. Defaults to the currently active Resource.',
              'area' => '',
              'area_trans' => '',
            ),
            'where' => 
            array (
              'name' => 'where',
              'desc' => 'prop_wayfinder.where_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Optional. A JSON object for where conditions for all items selected in the menu.',
              'area' => '',
              'area_trans' => '',
            ),
            'templates' => 
            array (
              'name' => 'templates',
              'desc' => 'prop_wayfinder.templates_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Optional. A comma-separated list of Template IDs to restrict selected Resources to.',
              'area' => '',
              'area_trans' => '',
            ),
            'previewUnpublished' => 
            array (
              'name' => 'previewUnpublished',
              'desc' => 'prop_wayfinder.previewunpublished_desc',
              'type' => 'textfield',
              'options' => '',
              'value' => '',
              'lexicon' => 'wayfinder:properties',
              'desc_trans' => 'Optional. If set to Yes, if you are logged into the mgr and have the view_unpublished permission, it will allow previewing of unpublished resources in your menus in the front-end.',
              'area' => '',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/**
 * Wayfinder Snippet to build site navigation menus
 *
 * Totally refactored from original DropMenu nav builder to make it easier to
 * create custom navigation by using chunks as output templates. By using
 * templates, many of the paramaters are no longer needed for flexible output
 * including tables, unordered- or ordered-lists (ULs or OLs), definition lists
 * (DLs) or in any other format you desire.
 *
 * @version 2.1.1-beta5
 * @author Garry Nutting (collabpad.com)
 * @author Kyle Jaebker (muddydogpaws.com)
 * @author Ryan Thrash (modx.com)
 * @author Shaun McCormick (modx.com)
 * @author Jason Coward (modx.com)
 *
 * @example [[Wayfinder? &startId=`0`]]
 *
 * @var modX $modx
 * @var array $scriptProperties
 * 
 * @package wayfinder
 */
$wayfinder_base = $modx->getOption(\'wayfinder.core_path\',$scriptProperties,$modx->getOption(\'core_path\').\'components/wayfinder/\');

/* include a custom config file if specified */
if (isset($scriptProperties[\'config\'])) {
    $scriptProperties[\'config\'] = str_replace(\'../\',\'\',$scriptProperties[\'config\']);
    $scriptProperties[\'config\'] = $wayfinder_base.\'configs/\'.$scriptProperties[\'config\'].\'.config.php\';
} else {
    $scriptProperties[\'config\'] = $wayfinder_base.\'configs/default.config.php\';
}
if (file_exists($scriptProperties[\'config\'])) {
    include $scriptProperties[\'config\'];
}

/* include wayfinder class */
include_once $wayfinder_base.\'wayfinder.class.php\';
if (!$modx->loadClass(\'Wayfinder\',$wayfinder_base,true,true)) {
    return \'error: Wayfinder class not found\';
}
$wf = new Wayfinder($modx,$scriptProperties);

/* get user class definitions
 * TODO: eventually move these into config parameters */
$wf->_css = array(
    \'first\' => isset($firstClass) ? $firstClass : \'\',
    \'last\' => isset($lastClass) ? $lastClass : \'last\',
    \'here\' => isset($hereClass) ? $hereClass : \'active\',
    \'parent\' => isset($parentClass) ? $parentClass : \'\',
    \'row\' => isset($rowClass) ? $rowClass : \'\',
    \'outer\' => isset($outerClass) ? $outerClass : \'\',
    \'inner\' => isset($innerClass) ? $innerClass : \'\',
    \'level\' => isset($levelClass) ? $levelClass: \'\',
    \'self\' => isset($selfClass) ? $selfClass : \'\',
    \'weblink\' => isset($webLinkClass) ? $webLinkClass : \'\'
);

/* get user templates
 * TODO: eventually move these into config parameters */
$wf->_templates = array(
    \'outerTpl\' => isset($outerTpl) ? $outerTpl : \'\',
    \'rowTpl\' => isset($rowTpl) ? $rowTpl : \'\',
    \'parentRowTpl\' => isset($parentRowTpl) ? $parentRowTpl : \'\',
    \'parentRowHereTpl\' => isset($parentRowHereTpl) ? $parentRowHereTpl : \'\',
    \'hereTpl\' => isset($hereTpl) ? $hereTpl : \'\',
    \'innerTpl\' => isset($innerTpl) ? $innerTpl : \'\',
    \'innerRowTpl\' => isset($innerRowTpl) ? $innerRowTpl : \'\',
    \'innerHereTpl\' => isset($innerHereTpl) ? $innerHereTpl : \'\',
    \'activeParentRowTpl\' => isset($activeParentRowTpl) ? $activeParentRowTpl : \'\',
    \'categoryFoldersTpl\' => isset($categoryFoldersTpl) ? $categoryFoldersTpl : \'\',
    \'startItemTpl\' => isset($startItemTpl) ? $startItemTpl : \'\'
);

/* process Wayfinder */
$output = $wf->run();
if ($wf->_config[\'debug\']) {
    $output .= $wf->renderDebugOutput();
}

/* output results */
if ($wf->_config[\'ph\']) {
    $modx->setPlaceholder($wf->_config[\'ph\'],$output);
} else {
    return $output;
}',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
      'phones' => 
      array (
        'fields' => 
        array (
          'id' => 33,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'phones',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '$phones=$modx->getOption(\'phones\');
$phone_array = explode(\',\', $phones);
$links = "";

foreach($phone_array as $phone){
    $num = trim($phone);
    $link = str_replace(" ", "", $num);
    $link = str_replace("-", "", $link);
    $link = str_replace("(", "", $link);
    $link = str_replace(")", "", $link);
    
    $data = [
        \'link\' => $link,
        \'num\' => $num
    ];
    
    $links.=$modx->getChunk($tpl, $data);
}

return $links;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '$phones=$modx->getOption(\'phones\');
$phone_array = explode(\',\', $phones);
$links = "";

foreach($phone_array as $phone){
    $num = trim($phone);
    $link = str_replace(" ", "", $num);
    $link = str_replace("-", "", $link);
    $link = str_replace("(", "", $link);
    $link = str_replace(")", "", $link);
    
    $data = [
        \'link\' => $link,
        \'num\' => $num
    ];
    
    $links.=$modx->getChunk($tpl, $data);
}

return $links;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
      'style' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'style',
          'caption' => 'Файл стилей',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
  ),
);